adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_spi_cmsis.c
        case 12:
            #if defined(RTE_SPI12_SSEL_NUM)
            masterConfig->sselNum = RTE_SPI12_SSEL_NUM;
            #endif
            #if defined(RTE_SPI12_SSEL_POL)
            masterConfig->sselPol = RTE_SPI12_SSEL_POL;
            #endif
            break;

        case 13:
            #if defined(RTE_SPI13_SSEL_NUM)
            masterConfig->sselNum = RTE_SPI13_SSEL_NUM;
            #endif
            #if defined(RTE_SPI13_SSEL_POL)
            masterConfig->sselPol = RTE_SPI13_SSEL_POL;
            #endif
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }

    switch (control & ARM_SPI_FRAME_FORMAT_Msk)
    {
        case ARM_SPI_CPOL0_CPHA0:
            masterConfig->polarity = kSPI_ClockPolarityActiveHigh;
            masterConfig->phase = kSPI_ClockPhaseFirstEdge;
            break;

        case ARM_SPI_CPOL0_CPHA1:
            masterConfig->polarity = kSPI_ClockPolarityActiveHigh;
            masterConfig->phase = kSPI_ClockPhaseSecondEdge;
            break;

        case ARM_SPI_CPOL1_CPHA0:
            masterConfig->polarity = kSPI_ClockPolarityActiveLow;
            masterConfig->phase = kSPI_ClockPhaseFirstEdge;
            break;

        case ARM_SPI_CPOL1_CPHA1:
            masterConfig->polarity = kSPI_ClockPolarityActiveLow;
            masterConfig->phase = kSPI_ClockPhaseSecondEdge;
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }

    if ((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) != 0U) { /* setting Number of Data bits */
        if ((((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) >= 4U) &&
            (((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) <= 16U)) {
            masterConfig->dataWidth =
                (spi_data_width_t)(((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) - 1U);
        }
    }

    switch (control & ARM_SPI_BIT_ORDER_Msk)
    {
        case ARM_SPI_LSB_MSB:
            masterConfig->direction = kSPI_LsbFirst;
            break;
        case ARM_SPI_MSB_LSB:
            masterConfig->direction = kSPI_MsbFirst;
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }
}

static void SPI_SlaveCommonControl(uint32_t control,
    cmsis_spi_resource_t *resource,
    uint8_t *status,
    spi_slave_config_t *slaveConfig) {
    switch (resource->instance)
    {
        case 0:
            #if defined(RTE_SPI0_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI0_SSEL_POL;
            #endif
            break;

        case 1:
            #if defined(RTE_SPI1_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI1_SSEL_POL;
            #endif
            break;
        case 2:
            #if defined(RTE_SPI2_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI2_SSEL_POL;
            #endif
            break;

        case 3:
            #if defined(RTE_SPI3_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI3_SSEL_POL;
            #endif
            break;

        case 4:
            #if defined(RTE_SPI4_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI4_SSEL_POL;
            #endif
            break;

        case 5:
            #if defined(RTE_SPI5_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI5_SSEL_POL;
            #endif
            break;

        case 6:
            #if defined(RTE_SPI6_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI6_SSEL_POL;
            #endif
            break;

        case 7:
            #if defined(RTE_SPI7_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI7_SSEL_POL;
            #endif
            break;

        case 8:
            #if defined(RTE_SPI8_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI8_SSEL_POL;
            #endif
            break;

        case 9:
            #if defined(RTE_SPI9_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI9_SSEL_POL;
            #endif
            break;

        case 10:
            #if defined(RTE_SPI10_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI10_SSEL_POL;
            #endif
            break;

        case 11:
            #if defined(RTE_SPI11_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI11_SSEL_POL;
            #endif
            break;

        case 12:
            #if defined(RTE_SPI12_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI12_SSEL_POL;
            #endif
            break;

        case 13:
            #if defined(RTE_SPI13_SSEL_POL)
            slaveConfig->sselPol = RTE_SPI13_SSEL_POL;
            #endif
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }

    switch (control & ARM_SPI_FRAME_FORMAT_Msk)
    {
        case ARM_SPI_CPOL0_CPHA0:
            slaveConfig->polarity = kSPI_ClockPolarityActiveHigh;
            slaveConfig->phase = kSPI_ClockPhaseFirstEdge;
            break;

        case ARM_SPI_CPOL0_CPHA1:
            slaveConfig->polarity = kSPI_ClockPolarityActiveHigh;
            slaveConfig->phase = kSPI_ClockPhaseSecondEdge;
            break;

        case ARM_SPI_CPOL1_CPHA0:
            slaveConfig->polarity = kSPI_ClockPolarityActiveLow;
            slaveConfig->phase = kSPI_ClockPhaseFirstEdge;
            break;

        case ARM_SPI_CPOL1_CPHA1:
            slaveConfig->polarity = kSPI_ClockPolarityActiveLow;
            slaveConfig->phase = kSPI_ClockPhaseSecondEdge;
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }
    if ((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) != 0U) { /* setting Number of Data bits */
        if ((((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) >= 4U) &&
            (((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) <= 16U)) {
            slaveConfig->dataWidth =
                (spi_data_width_t)(((control & (uint32_t)ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos) - 1U);
        }
    }
    switch (control & ARM_SPI_BIT_ORDER_Msk)
    {
        case ARM_SPI_LSB_MSB:
            slaveConfig->direction = kSPI_LsbFirst;
            break;
        case ARM_SPI_MSB_LSB:
            slaveConfig->direction = kSPI_MsbFirst;
            break;

        default:
            /* Avoid MISRA 16.4 violation */
            break;
    }
}

static ARM_DRIVER_VERSION SPIx_GetVersion(void) {
    return s_SPIDriverVersion;
}

static ARM_SPI_CAPABILITIES SPIx_GetCapabilities(void) {
    return s_SPIDriverCapabilities;
}

#endif

